public class SubjectsInRussian {

    String subjects = """
            Философия
            Биоэтика
            Психология и педагогика
            Правоведение
            История Отечества
            История медицины
            Иностранный язык
            Латинский язык
            Физика, математика
            Медицинская информатика
            Химия
            Биология
            Биологическая химия, биохимия полости рта
            Анатомия человека
            Гистология, эмбриология и цитология
            Нормальная физиология
            Фармакология
            Микробиология, вирусология, микробиология полости рта
            Иммунология, клиническая иммунология
            Патофизиология, патофизиология головы и шеи
            Патологическая анатомия, патологическая анатомия головы и шеи
            Эпидемиология
            Гигиена
            Общественное здоровье и здравоохранение, экономика здравоохранения
            Пропедевтика внутренних болезней, внутренние болезни, клиническая фармакология
            Хирургические болезни, общая хирургия
            Лучевая диагностика
            Безопасность жизнедеятельности
            Инфекционные болезни, фтизиатрия
            Медицинская реабилитация
            Неврология
            Оториноларингология
            Офтальмология
            Акушерство и гинекология
            Педиатрия
            Стоматологическое материаловедение
            Стоматология профилактическая
            Стоматология пропедевтическая
            Кариесология и заболевание твердых тканей зубов
            Эндодонтия
            Пародонтология
            Стоматологическая радиология
            Стоматология терапевтическая, геронтостоматология
            Стоматология хирургическая, анестезиология в стоматологии
            Стоматология ортопедическая, гнатология
            Стоматология клиническая
            Этика, право и менеджмент в стоматологии
            Зубопротезирование, протезирование зубных рядов и полном отсутствии зубов
            Челюстно-лицевая хирургия
            Детская стоматология
            Медицинская генетика
            Ортодонтия
            Физическая культура
            Иностранный язык в медицинской практике
            Топографическая анатомия и оперативная хирургия
            Нормальная физиология - физиология челюстно-лицевой области
            Регенеративная медицина
            Детская челюстно-лицевая хирургия
            Психиатрия и наркология
            Судебная медицина
            Имплантология и реконструктивная хирургия полости рта
            Дерматовенерология
            Иностранный язык в биомедицинских исследованиях
            Нано- и клеточные технологии в биологии и медицине
            Методы физиологических исследований
            Современная эндодонтия
            Челюстно-лицевая косметология
            Анестезиология и реаниматология
            Деловой иностранный язык (английский)
            Методология научных исследований в менеджменте
            Проектное управление в отраслях экономики
            Современный стратегический менеджмент
            Управленческая экономика
            Корпоративные финансы
            Методология управления стратегическими проектами компании
            Модели и механизмы стратегического корпоративного управления
            Организационная теория и дизайн
            Правовое обеспечение корпоративного управления
            Технологии принятия и реализации корпоративных стратегических решений
            Трансформационный менеджмент
            Управление стоимостью компании (бизнеса)
            Сетевой менеджмент
            Стратегическое управление инвестициями
            Управление стратегической реорганизацией
            Цифровые технологии в управлении проектами
            Культура речи
            Культурология
            Психология, педагогика и медицинская психология
            Латинский язык и основы терминологии
            Физика, математика и информатика
            Общая и биоорганическая химия
            Биология с экологией
            Биологическая химия
            Нормальная анатомия
            Патологическая анатомия, секционный курс
            Гистология, эмбриологии, цитология
            Микробиология, вирусология, иммунология
            Фармакология, клиническая фармакология
            Патологическая физиология
            Гигиена и основы экологии человека, военная гигиена
            Общественное здоровье и здравоохранение
            Эпидемиология, военная эпидемиология
            Лучевая терапия и лучевая диагностика
            Лечебная физкультура и врачебный контроль
            Инфекционные болезни
            Дерматовенерологии
            Неврология, нейрохирургия
            Психиатрия, наркология
            Военная и экстремальная медицина
            Общий уход за больными (терапия)
            Пропедевтика внутренних болезней
            Внутренние болезни, физиотерапия, военно-полевая терапия
            Эндокринология
            Профессиональные болезни
            Фтизиопульмонология
            Поликлиническая терапия
            Общий уход за больными (хирургия)
            Общая хирургия, анестезиология
            Оперативная хирургия и топографическая анатомия
            Хирургические болезни, детская хирургия
            Стоматология
            Урология
            Травматология и ортопедия с военно-полевой хирургией
            Онкология
            Реанимация, интенсивная терапия
            Элективы
            Педагогика
            Патология
            Гигиена и эпидемиология чрезвычайных ситуаций
            Микробиология
            Терапевтическая стоматология
            Ортопедическая стоматология
            Хирургическая стоматология
            Клиническая имплантология
            Диагностика, скрининг злокачественных опухолей
            Особо-опасные инфекции
            Цифровые технологии в ортодонтии
            Ортодонтическое лечение пациентов с заболеваниями пародонта
            История
            Русский язык и культура речи
            Экономика
            Основы правоведения и противодействия коррупции
            Информационные технологии
            Физическая культура и спорт
            Общая психология
            Возрастная и социальная психология
            Педагогическая психология
            Методы психолого-педагогического взаимодействия участников образовательного процесса
            Психолого-педагогическое сопровождение инклюзивного образования
            Феномен образовательной деятельности
            Конструирование и реализация воспитательных процессов
            Конструирование и реализация образовательных процессов
            Практика личностно-ориентированного образования
            Социология
            Математика и основы математической обработки информации
            Концепции современного естествознания
            Физика
            Теория и методика обучения технологии
            Информационные и коммуникационные технологии в образовании
            Информатика
            Теоретическая механика
            Сопротивление материалов
            Теория механизмов и машин
            Начертательная геометрия
            Черчение
            Электротехника
            Радиотехника
            Детали машин
            Материаловедение
            Основы творческо-конструкторской деятельности
            Конструирование и моделирование
            Технологический практикум
            Ремонтно-строительные работы в быту
            Профессиональное самоопределение школьников
            Организация проектно-исследовательской деятельности школьников
            Арт-педагогика
            Педагогическая риторика
            Основы предпринимательства
            Шахматы
            Олимпиадное движение школьников
            Элективные дисциплины (модули) по физической культуре и спорту
            Школьная психодиагностика
            Психолого-педагогическая диагностика и развитие одаренности детей и молодежи
            Исследовательская деятельность в образовании
            Основы современного производства
            Игровые технологии в образовании
            Нормативно-правовое обеспечение образования
            Экономика семьи
            Резание материалов, станки и инструменты
            Метрология, стандартизация и сертификация
            Художественные ремёсла и народные промыслы
            Сельскохозяйственные технологии
            Сварочное дело
            Экономика образования
            Профессиональные юридические коммуникации
            Римское частное право
            Противодействие легализации доходов, полученных преступным путем
            Профессиональная деятельность юриста
            Стилистика и риторика
            Российское предпринимательское право
            Семейное право
            Право собственности
            Правовая статистика
            Политология
            Право Европейского союза
            Проблемы теории права
            Прокурорский надзор
            Правовое регулирование оперативно-розыскной деятельности
            Правовое регулирование рекламной деятельности
            Финансовое право
            Уголовное право (Особенная часть)
            Уголовный процесс
            Экономическая теория
            Юридическая психология
            Экологическое право
            Экономическая социология
            Судебная психиатрия
            Таможенное право
            Судебная власть и правоохранительные органы
            Уголовно-исполнительное право
            Уголовное право (Общая часть)
            Теория государства и права
            Трудовое право
            Отечественная история
            Земельное право
            Гражданское право (Особенная часть)
            Жилищное право
            Информационно-библиотечная культура
            Искусство полемики
            Институциональная экономика
            Информатика и математика
            Административное право
            Арбитражный процесс
            Адвокатура
            Административная юстиция
            Гражданский процесс
            Гражданское право (Общая часть)
            Базы данных
            Бухгалтерский учет, аудит, судебная бухгалтерия
            Логика
            Международное право
            Налоговое право
            Международное частное право
            Муниципальное право
            История политических и правовых учений
            Конституционное право России
            История государства и права зарубежных стран
            История отечественного государства и права
            Криминалистика
            Криминология
            Конституционное право зарубежных стран
            Региональная экономика субъектов РФ: Северо-Западный федеральный округ
            Математика
            Экология
            Информационные системы и сети
            Учебный практикум по вычислительной технике
            Основы системного анализа
            Теоретические основы товароведения и экспертизы
            Стандартизация, метрология и сертификация
            Основы микробиологии
            Оборудование предприятий
            Логистика
            Рекламная деятельность
            Правовое регулирование профессиональной деятельности
            Менеджмент
            Маркетинг
            Рынок непродовольственных товаров
            Бухгалтерский учет и анализ хозяйственной деятельности
            Налоговые системы
            Организация и управление предприятием
            Биологическая повреждаемость непродовольственных товаров
            Этики и психология в товароведной деятельности
            Человек и его потребности
            Основы внешнеэкономической деятельности
            Методы и средства исследований потребительских товаров
            Методы и приборы оценки качества непродовольственных товаров
            Товароведение и экспертиза товаров хозяйственного назначения
            Товароведение и экспертиза товаров культурно-бытового назначения
            Товароведение и экспертиза текстильных, швейных и трикотажных товаров
            Товароведение и экспертиза кожевенно-обувных, пушно-меховых товаров
            Управление качеством
            Информационное обеспечение товароведения и экспертизы товаров
            Экспертиза непродовольственных товаров
            Безопасность непродовольственных товаров
            Эстетика и дизайн непродовольственных товаров
            Товароведение упаковочных материалов и тары для непродовольственных товаров
            Технология хранения и транспортирования непродовольственных товаров
            Таможенная экспертиза качества непродовольственных товаров и сырья
            Сертификация товаров хозяйственного и культурно-бытового назначения
            Сервисное обслуживание товаров хозяйственного и культурно-бытового назначения
            Идентификация и фальсификации потребительских товаров
            Товароведение и экспертиза продовольственных товаров
            Неорганическая химия
            Аналитическая химия
            Органическая химия
            Физическая химия
            Химические основы биологических процессов
            Квантовая химия
            Психология
            Введение в специальность (профессию)
            Элективные дисциплины по физической культуре и спорту
            Академическое письмо (на иностранном языке)
            Основы православной культуры
            Академическое письмо (на русском языке)
            Основы проектного менеджмента
            Коллоидная химия
            Строение вещества
            Физические методы исследования в химии
            Хроматографические и ионообменные методы
            Спец. главы химии на английском языке
            Биология с основами экологии
            Методика преподавания химии
            Новые информационные технологии в химии
            Техника химического эксперимента
            Высокомолекулярные соединения
            Химическая технология
            Электрохимические методы анализа
            Спектральные методы анализа биологически активных веществ
            Теоретические основы адсорбции на границах раздела фаз
            Аналитический контроль пищевых продуктов и биологически активных веществ
            Экотоксикология (на английском языке)
            Основы кристаллохимии
            Методы анализа
            Химическое материаловедение
            Химические основы медицинского материаловедения
            """;

    public String[] getSubjectsArray() {
        return subjects.split("\n");
    }
}