public class SubjectsInRussian {

    String subjects = "Философия\n" +
            "Биоэтика\n" +
            "Психология и педагогика\n" +
            "Правоведение\n" +
            "История Отечества\n" +
            "История медицины\n" +
            "Иностранный язык\n" +
            "Латинский язык\n" +
            "Физика, математика\n" +
            "Медицинская информатика\n" +
            "Химия\n" +
            "Биология\n" +
            "Биологическая химия, биохимия полости рта\n" +
            "Анатомия человека\n" +
            "Гистология, эмбриология и цитология\n" +
            "Нормальная физиология\n" +
            "Фармакология\n" +
            "Микробиология, вирусология, микробиология полости рта\n" +
            "Иммунология, клиническая иммунология\n" +
            "Патофизиология, патофизиология головы и шеи\n" +
            "Патологическая анатомия, патологическая анатомия головы и шеи\n" +
            "Эпидемиология\n" +
            "Гигиена\n" +
            "Общественное здоровье и здравоохранение, экономика здравоохранения\n" +
            "Пропедевтика внутренних болезней, внутренние болезни, клиническая фармакология\n" +
            "Хирургические болезни, общая хирургия\n" +
            "Лучевая диагностика\n" +
            "Безопасность жизнедеятельности\n" +
            "Инфекционные болезни, фтизиатрия\n" +
            "Медицинская реабилитация\n" +
            "Неврология\n" +
            "Оториноларингология\n" +
            "Офтальмология\n" +
            "Акушерство и гинекология\n" +
            "Педиатрия\n" +
            "Стоматологическое материаловедение\n" +
            "Стоматология профилактическая\n" +
            "Стоматология пропедевтическая\n" +
            "Кариесология и заболевание твердых тканей зубов\n" +
            "Эндодонтия\n" +
            "Пародонтология\n" +
            "Стоматологическая радиология\n" +
            "Стоматология терапевтическая, геронтостоматология\n" +
            "Стоматология хирургическая, анестезиология в стоматологии\n" +
            "Стоматология ортопедическая, гнатология\n" +
            "Стоматология клиническая\n" +
            "Этика, право и менеджмент в стоматологии\n" +
            "Зубопротезирование, протезирование зубных рядов и полном отсутствии зубов\n" +
            "Челюстно-лицевая хирургия\n" +
            "Детская стоматология\n" +
            "Медицинская генетика\n" +
            "Ортодонтия\n" +
            "Физическая культура\n" +
            "Иностранный язык в медицинской практике\n" +
            "Топографическая анатомия и оперативная хирургия\n" +
            "Нормальная физиология - физиология челюстно-лицевой области\n" +
            "Регенеративная медицина\n" +
            "Детская челюстно-лицевая хирургия\n" +
            "Психиатрия и наркология\n" +
            "Судебная медицина\n" +
            "Имплантология и реконструктивная хирургия полости рта\n" +
            "Дерматовенерология\n" +
            "Иностранный язык в биомедицинских исследованиях\n" +
            "Нано- и клеточные технологии в биологии и медицине\n" +
            "Методы физиологических исследований\n" +
            "Современная эндодонтия\n" +
            "Челюстно-лицевая косметология\n" +
            "Анестезиология и реаниматология\n" +
            "Деловой иностранный язык (английский)\n" +
            "Методология научных исследований в менеджменте\n" +
            "Проектное управление в отраслях экономики\n" +
            "Современный стратегический менеджмент\n" +
            "Управленческая экономика\n" +
            "Корпоративные финансы\n" +
            "Методология управления стратегическими проектами компании\n" +
            "Модели и механизмы стратегического корпоративного управления\n" +
            "Организационная теория и дизайн\n" +
            "Правовое обеспечение корпоративного управления\n" +
            "Технологии принятия и реализации корпоративных стратегических решений\n" +
            "Трансформационный менеджмент\n" +
            "Управление стоимостью компании (бизнеса)\n" +
            "Сетевой менеджмент\n" +
            "Стратегическое управление инвестициями\n" +
            "Управление стратегической реорганизацией\n" +
            "Цифровые технологии в управлении проектами\n" +
            "Культура речи\n" +
            "Культурология\n" +
            "Психология, педагогика и медицинская психология\n" +
            "Латинский язык и основы терминологии\n" +
            "Физика, математика и информатика\n" +
            "Общая и биоорганическая химия\n" +
            "Биология с экологией\n" +
            "Биологическая химия\n" +
            "Нормальная анатомия\n" +
            "Патологическая анатомия, секционный курс\n" +
            "Гистология, эмбриологии, цитология\n" +
            "Микробиология, вирусология, иммунология\n" +
            "Фармакология, клиническая фармакология\n" +
            "Патологическая физиология\n" +
            "Гигиена и основы экологии человека, военная гигиена\n" +
            "Общественное здоровье и здравоохранение\n" +
            "Эпидемиология, военная эпидемиология\n" +
            "Лучевая терапия и лучевая диагностика\n" +
            "Лечебная физкультура и врачебный контроль\n" +
            "Инфекционные болезни\n" +
            "Дерматовенерологии\n" +
            "Неврология, нейрохирургия\n" +
            "Психиатрия, наркология\n" +
            "Военная и экстремальная медицина\n" +
            "Общий уход за больными (терапия)\n" +
            "Пропедевтика внутренних болезней\n" +
            "Внутренние болезни, физиотерапия, военно-полевая терапия\n" +
            "Эндокринология\n" +
            "Профессиональные болезни\n" +
            "Фтизиопульмонология\n" +
            "Поликлиническая терапия\n" +
            "Общий уход за больными (хирургия)\n" +
            "Общая хирургия, анестезиология\n" +
            "Оперативная хирургия и топографическая анатомия\n" +
            "Хирургические болезни, детская хирургия\n" +
            "Стоматология\n" +
            "Урология\n" +
            "Травматология и ортопедия с военно-полевой хирургией\n" +
            "Онкология\n" +
            "Реанимация, интенсивная терапия\n" +
            "Элективы\n" +
            "Педагогика\n" +
            "Патология\n" +
            "Гигиена и эпидемиология чрезвычайных ситуаций\n" +
            "Микробиология\n" +
            "Терапевтическая стоматология\n" +
            "Ортопедическая стоматология\n" +
            "Хирургическая стоматология\n" +
            "Клиническая имплантология\n" +
            "Диагностика, скрининг злокачественных опухолей\n" +
            "Особо-опасные инфекции\n" +
            "Цифровые технологии в ортодонтии\n" +
            "Ортодонтическое лечение пациентов с заболеваниями пародонта\n" +
            "История\n" +
            "Русский язык и культура речи\n" +
            "Экономика\n" +
            "Основы правоведения и противодействия коррупции\n" +
            "Информационные технологии\n" +
            "Физическая культура и спорт\n" +
            "Общая психология\n" +
            "Возрастная и социальная психология\n" +
            "Педагогическая психология\n" +
            "Методы психолого-педагогического взаимодействия участников образовательного процесса\n" +
            "Психолого-педагогическое сопровождение инклюзивного образования\n" +
            "Феномен образовательной деятельности\n" +
            "Конструирование и реализация воспитательных процессов\n" +
            "Конструирование и реализация образовательных процессов\n" +
            "Практика личностно-ориентированного образования\n" +
            "Социология\n" +
            "Математика и основы математической обработки информации\n" +
            "Концепции современного естествознания\n" +
            "Физика\n" +
            "Теория и методика обучения технологии\n" +
            "Информационные и коммуникационные технологии в образовании\n" +
            "Информатика\n" +
            "Теоретическая механика\n" +
            "Сопротивление материалов\n" +
            "Теория механизмов и машин\n" +
            "Начертательная геометрия\n" +
            "Черчение\n" +
            "Электротехника\n" +
            "Радиотехника\n" +
            "Детали машин\n" +
            "Материаловедение\n" +
            "Основы творческо-конструкторской деятельности\n" +
            "Конструирование и моделирование\n" +
            "Технологический практикум\n" +
            "Ремонтно-строительные работы в быту\n" +
            "Профессиональное самоопределение школьников\n" +
            "Организация проектно-исследовательской деятельности школьников\n" +
            "Арт-педагогика\n" +
            "Педагогическая риторика\n" +
            "Основы предпринимательства\n" +
            "Шахматы\n" +
            "Олимпиадное движение школьников\n" +
            "Элективные дисциплины (модули) по физической культуре и спорту\n" +
            "Школьная психодиагностика\n" +
            "Психолого-педагогическая диагностика и развитие одаренности детей и молодежи\n" +
            "Исследовательская деятельность в образовании\n" +
            "Основы современного производства\n" +
            "Игровые технологии в образовании\n" +
            "Нормативно-правовое обеспечение образования\n" +
            "Экономика семьи\n" +
            "Резание материалов, станки и инструменты\n" +
            "Метрология, стандартизация и сертификация\n" +
            "Художественные ремёсла и народные промыслы\n" +
            "Сельскохозяйственные технологии\n" +
            "Сварочное дело\n" +
            "Экономика образования\n" +
            "Профессиональные юридические коммуникации\n" +
            "Римское частное право\n" +
            "Противодействие легализации доходов, полученных преступным путем\n" +
            "Профессиональная деятельность юриста\n" +
            "Стилистика и риторика\n" +
            "Российское предпринимательское право\n" +
            "Семейное право\n" +
            "Право собственности\n" +
            "Правовая статистика\n" +
            "Политология\n" +
            "Право Европейского союза\n" +
            "Проблемы теории права\n" +
            "Прокурорский надзор\n" +
            "Правовое регулирование оперативно-розыскной деятельности\n" +
            "Правовое регулирование рекламной деятельности\n" +
            "Финансовое право\n" +
            "Уголовное право (Особенная часть)\n" +
            "Уголовный процесс\n" +
            "Экономическая теория\n" +
            "Юридическая психология\n" +
            "Экологическое право\n" +
            "Экономическая социология\n" +
            "Судебная психиатрия\n" +
            "Таможенное право\n" +
            "Судебная власть и правоохранительные органы\n" +
            "Уголовно-исполнительное право\n" +
            "Уголовное право (Общая часть)\n" +
            "Теория государства и права\n" +
            "Трудовое право\n" +
            "Отечественная история\n" +
            "Земельное право\n" +
            "Гражданское право (Особенная часть)\n" +
            "Жилищное право\n" +
            "Информационно-библиотечная культура\n" +
            "Искусство полемики\n" +
            "Институциональная экономика\n" +
            "Информатика и математика\n" +
            "Административное право\n" +
            "Арбитражный процесс\n" +
            "Адвокатура\n" +
            "Административная юстиция\n" +
            "Гражданский процесс\n" +
            "Гражданское право (Общая часть)\n" +
            "Базы данных\n" +
            "Бухгалтерский учет, аудит, судебная бухгалтерия\n" +
            "Логика\n" +
            "Международное право\n" +
            "Налоговое право\n" +
            "Международное частное право\n" +
            "Муниципальное право\n" +
            "История политических и правовых учений\n" +
            "Конституционное право России\n" +
            "История государства и права зарубежных стран\n" +
            "История отечественного государства и права\n" +
            "Криминалистика\n" +
            "Криминология\n" +
            "Конституционное право зарубежных стран\n" +
            "Региональная экономика субъектов РФ: Северо-Западный федеральный округ\n" +
            "Математика\n" +
            "Экология\n" +
            "Информационные системы и сети\n" +
            "Учебный практикум по вычислительной технике\n" +
            "Основы системного анализа\n" +
            "Теоретические основы товароведения и экспертизы\n" +
            "Стандартизация, метрология и сертификация\n" +
            "Основы микробиологии\n" +
            "Оборудование предприятий\n" +
            "Логистика\n" +
            "Рекламная деятельность\n" +
            "Правовое регулирование профессиональной деятельности\n" +
            "Менеджмент\n" +
            "Маркетинг\n" +
            "Рынок непродовольственных товаров\n" +
            "Бухгалтерский учет и анализ хозяйственной деятельности\n" +
            "Налоговые системы\n" +
            "Организация и управление предприятием\n" +
            "Биологическая повреждаемость непродовольственных товаров\n" +
            "Этики и психология в товароведной деятельности\n" +
            "Человек и его потребности\n" +
            "Основы внешнеэкономической деятельности\n" +
            "Методы и средства исследований потребительских товаров\n" +
            "Методы и приборы оценки качества непродовольственных товаров\n" +
            "Товароведение и экспертиза товаров хозяйственного назначения\n" +
            "Товароведение и экспертиза товаров культурно-бытового назначения\n" +
            "Товароведение и экспертиза текстильных, швейных и трикотажных товаров\n" +
            "Товароведение и экспертиза кожевенно-обувных, пушно-меховых товаров\n" +
            "Управление качеством\n" +
            "Информационное обеспечение товароведения и экспертизы товаров\n" +
            "Экспертиза непродовольственных товаров\n" +
            "Безопасность непродовольственных товаров\n" +
            "Эстетика и дизайн непродовольственных товаров\n" +
            "Товароведение упаковочных материалов и тары для непродовольственных товаров\n" +
            "Технология хранения и транспортирования непродовольственных товаров\n" +
            "Таможенная экспертиза качества непродовольственных товаров и сырья\n" +
            "Сертификация товаров хозяйственного и культурно-бытового назначения\n" +
            "Сервисное обслуживание товаров хозяйственного и культурно-бытового назначения\n" +
            "Идентификация и фальсификации потребительских товаров\n" +
            "Товароведение и экспертиза продовольственных товаров";

    public String[] getSubjectsArray() {
        return subjects.split("\n");
    }
}